Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON KO>EN God of High School.tmx
Source language: ko
Languages: en

source: 그곳에서의 삶이 지루해지기 시작 할 때 즈음
en: just when life there started to get boring...

source: 근데 어쩌다 이꼴이야?
en: what happened to you?

source: 자신의 부활을 이끌어줄 존재가 나타날 때 까지...
en: they were waiting for the one who would revive them...

source: 이제그만 네 몸을 내놓거라.
en: it’s time for you to give me your body.

source: 끄아아!
en: arghhh!

source: 다함이 없이 끝없는...
en: inexhaustible, limitless...

source: 성운의 움직임과 반경수치가...이상해요.
en: the nebula’s activity and its computed diameter are... unusual.

source: 바보...
en: you jerk...

source: 우리쪽 세상에선 저것 때문에 세상이 멸망해 버렸으니까...
en: it destroyed my world.

source: 진...
en: jin...

source: 티익
en: CRACK

source: 크으!
en: ugh!

source: 쿠{j}콰
en: rumble{j}

source: 진!
en: jin!

source: 쿠궁
en: rumble

source: 맙소사...부피가 오르트 구름급?!
en: oh my god... it's the size of the oort cloud*?! *the oort cloud is a giant spherical shell of icy, comet-like objects that surrounds our solar system.

source: 자기 자식에게...
en: to your own child...

source: 신들의 수장
en: and the leader of the gods.

source: 분명..{j}이건 새로운 신화의 시작.
en: it was, without a doubt, the birth of a new myth...{j}

source: 끄덕
en: nod

source: 재생하면 그만이다?!
en: because you can just regenerate?!

source: 미친...
en: dammit...

source: 꼭...살아!
en: you have to live!

source: 아이는...
en: the child...

source: 남조선...{j}어디까지 가버린거야?
en: my old enemy... just how much stronger have you gotten?{j}

source: 최하층의 존재들이 그를 감싸기 시작했고,
en: the lowest class of beings began to protect and watch over him...

source: 스윽
en: whish

source: 지난번 첫 싸움에서 양으로 널 꺽는건 불가능하다 느꼈지.
en: during our last fight, I learned that I couldn’t beat you with quantity.

source: 계속 떠오르게 한단 말이지...
en: ...I keep remembering those words...

source: 보고있니?
en: are you seeing this?

source: 티틱
en: crack

source: 우리의 죄를 사하심에...
en: for the sake of our sins...

source: 뭐지?!
en: what’s happening?!

source: 그래..{j}그래...
en: there, there...{j}

source: 으악!
en: ack!

source: 믿어.
en: I believe in you.

source: 그만 죽어.
en: die already.

source: 그래서..각성의 순간에, 여래의 형상이 보였군.
en: that’s why i saw tathagata right before i awakened...

source: 누군가...
en: someone’s...

source: 정예부대 앞으로!
en: elite troops, forward!

source: 기체가..
en: the fuselage

source: 서로를 뜯어먹고 있어?!
en: they’re eating each other?!

source: 기긱
en: swoosh

source: 존명
en: higher life.

source: 다행이...{j}완전히 힘을 잃은 건 아냐.
en: thankfully... I didn’t lose all my power.

source: 하필이면 내가 기분이 좀 언짢을 때...{j}자아 찾기라니...
en: of all times, you chose now, when i’m in a bad mood... to find yourself...{j}

source: 키잉
en: fwoom

source: 움직인다?
en: they’re moving?

source: 떵
en: whoom

source: 항상 식장하고 있으라...
en: ...so be wary at all times...

source: 렌즈효과?
en: is that a lens?

source: NOA 최대 출력 준비
en: get noa ready to fire at full power.

source: 오르트 구름 폭주합니다.
en: the oort cloud is reacting violently.

source: 어서 안일어나고?
en: get up.

source: 널 데려가지 않는다.
en: i am not taking you with me.

source: 한번...{j}해볼게.
en: I’ll... give it a go.{j}

source: 상처가 너무깊어!
en: her wound is too deep!

source: 슈
en: swoosh

source: 아!
en: ah!

source: 사실이야?
en: is it true?

source: 끄아아아!!
en: arghhh!!!

source: 열어달라..
en: open the...

source: 너무 강해!
en: they’re too strong!

source: 기적과 기적 기적에 기적 기적의 기적의 기적이 만나...
en: miracles on top of miracles within miracles have all come together...

source: 왜그래?
en: what’s the matter?

source: 회피!
en: retreat!

source: 흡!
en: ha!

source: 벌레가 아니라 요정이다.
en: it’s a fairy, not a bug.

source: 번뇌
en: agonies

source: 108야차 나기동!!!
en: the beast gidong nah!!!

source: 죽어.
en: die.

source: 중간계에...{j}있을때...
en: when i was in the central realm...{j}

source: 자...나에게 먹혀...
en: now... be eaten by me...

source: 자~ 이세상에선 어떻게 뽑아 먹을까...
en: now, how should i suck them dry in this world...?

source: 어느날 눈을 뜨면,
en: because it felt like one day...

source: 부름에 답하라.
en: heed my call.

source: 박무봉의 오른팔
en: mubong park’s right arm

source: 군체 전체좌표 확인 및 공유
en: confirming each fairy colony's location and sending them your way.

source: 쪼렙(단모리)에서의 레벨업이 고렙(진모리)의 레벨업으로 이어진다면?
en: what happens if the leveling up he did as a weakling (mori dan) carries over to when he’s overpowered (mori jin)?

source: 마지막...
en: one last time...

source: 행성파괴용...
en: this is the planet-destroying...

source: 기체가..{j}버티질 못합니다.
en: the fuselage won’t be able to take it!{j}

source: 크아아아아!!
en: arghhh!!!

source: 어이 아우 동생 자매
en: hey, sister of my brother.

source: 네가 입버릇처럼 하던 말을 잊은게냐?
en: have you forgotten your favorite phrase?

source: 예언에서 말한...{j}선지자는 너였어...
en: {j}the prophet from the prophecy... was you...

source: 난...건가?
en: come back to life...?

source: 어서와...
en: hey...

source: 말하지 않았느냐.
en: i told you, did i not?

source: 크오오오!
en: arghhh!

source: 너무 위험한...{j}상황에 데리고 와버렸어.
en: {j}i got you mixed up in something way too dangerous...

source: 대,대위...
en: d-daewi...

source: NOA가...{j}부서져...
en: NOA is going to be destroyed...{j}

source: 따뜻해...
en: it’s warm...

source: 끄으으..
en: ugh...

source: 원래의 힘에 다다른다!!
en: now i’ll get my original strength back!!!

source: 차력공유
en: power sharing

source: 강하면!!쎄면 뭐해?!
en: what good is being strong?!

source: 엄청난...{j}스피드...
en: what incredible speed...{j}

source: 명확해진 만큼 가속도가 붙었고,
en: having a clear goal made him increase his pace...

source: 어떻게 돌원숭이 따위에게 진거지?
en: how did he lose to a mere stone monkey?

source: 과부하 날개파손
en: wings destroyed due to engine overload

source: 파수꾼?!
en: you call yourself a guardian?!

source: 모두 마음껏 날뛰어줘.
en: so, let’s go wild.

source: 지금의 네가 무얼 할 수 있다는거지?
en: what can you do right now?

source: ...를 둘러싸고있는 오르트 구름
en: and surrounding the kuiper belt is the oort cloud...

source: 츠{j}파{j}파
en: {j}{j}whish

source: 쉬{j}익
en: whoosh{j}

source: 이게...{j}마지막이야!!
en: this is... the last one!!!{j}

source: 절대신?!
en: the supreme god?!

source: 본래의 네 모습을 찾아가겠다는거군.
en: you were talking about getting back your original form.

source: 박무진이다. “다함이 없는...{j}무한한...”
en: it’s mujin park. mujin means “inexhaustible”... “limitless”...{j}

source: 다함이 없는 무한한...!!
en: inexhaustible and limitless...!!!

source: 하는 짓까지...
en: ...to the things you do...

source: 녀석들과 함께 있으면.
en: when i’m with them.

source: 저 무기를 부숴버려.
en: break that weapon.

source: 처음 그(녀)가 눈을 뜬곳은 천계의 제일 밑바닥...
en: when he opened his eyes, it was at the bottom of the heavenly realm...

source: 먹어치워!
en: eat it!

source: 아줌마..
en: ms. heal...

source: 그것은 도적처럼 찾아오리니...
en: on the appointed day, it shall come like a thief in the night,{j}so be wary at all times...

source: 설마 저건?
en: no way, is that...?

source: 너무 어려...
en: ...for a baby to control...

source: 역시 전설!!
en: i’d expect nothing less from a legend!!!

source: 나 역시 한때는 인간이었던 몸
en: i, too, was human once.

source: 느리구나...
en: you’re slow...

source: 응
en: yeah.

source: 시간마법 한계 범위까지 끌어올렸어.
en: I’ve stretched my time magic to the limit.

source: 어디 멋진 말로 이 상황을 타개해 보거라.
en: try and see if pretty words can get you through this.

source: 칙
en: snap

source: 너희는...{j}성공...해라...
en: succeed... where I failed...{j}

source: 어떨까?
en: what do you think?

source: 차캉
en: clang

source: 우리를 활용하라....
en: use us...

source: 흠!
en: hmph

source: 못견...뎌!
en: it's... not gonna hold up!

source: 역시 이것밖에 없어!
en: nothing beats that one!

source: 549화
en: episode 549

source: 퉤
en: ptooey

source: 다...끝났다.
en: it’s... over.

source: 생각해보면...
en: now that i think about it...

source: 오오!
en: ohhh!

source: 무봉이든 여래든, 우리 갚아야 할게 남았잖아?{j}아직 많이...
en: whoever you are, we’ve still got a debt to settle, don’t we? a big one...

source: 저건?
en: that’s?

source: 후웅
en: whoosh

source: 비켜!!
en: get away from her!!!

source: 타앗
en: leap

source: 일점돌파
en: break through it at a single point.

source: 진폭을 더해주면?
en: ...vibrations to your slowed time?

source: 지켜봐줘.
en: watch over me.

source: 널 뛰어 넘을거야.
en: i’m going to surpass you.

source: 아프지..마..
en: feel better.

source: “아빠”
en: daddy...

source: 최대한 멀리...!
en: get as far away as you can...!

source: 투확
en: wham

source: 이게 무슨...?!
en: what...?!

source: 정신차려!{j}박무봉!
en: {j}mubong, wake up!

source: 아까보다....{j}더...많지?
en: there's more than there were a minute ago... right?{j}

source: ...{j}굉장해...
en: amazing...{j}

source: 힘이...{j}빠져...나가...
en: i’m... losing strength...{j}

source: 투욱
en: thud

source: 쎄지?
en: is strong, isn’t he?

source: 제발 움직여...
en: please move...

source: 목숨을 걸어?
en: you’ll risk your life?

source: 그리고 인간의 구원.
en: and the salvation of humanity.

source: 사라졌음...
en: is gone...

source: 후두둑
en: crash

source: 야이 개XX들아!
en: you bastards!

source: 난...박...
en: I’m... mujin...

source: 神
en: god.

source: 퍼석
en: splinter

source: 110대 패용!
en: 110th tortoise!

source: 넌 구원을 바랬어.
en: you wanted salvation.

source: 구원.
en: salvation.

source: 제...발...
en: please...

source: 오른다리가...
en: my right leg...

source: 구 인류
en: old humanity

source: 어..?!
en: huh?

source: 이번엔 량이 아닌 소수정예
en: so this time, i brought only the best of the best.

source: 뚫어어어어어어!!
en: go throuuugh!!!

source: 아줌마!{j}아줌마!{j}아줌마!
en: ms. heal... you’re really here!!!{j}{j}

source: 안좋은 기억이 잠깐...
en: i remembered something bad...

source: 내게로...{j}스며든다.
en: {j}...flows into me.

source: 힘의 순환...
en: power circulates...

source: 힘을..흘렸다?
en: he... redirected my attack?

source: 처음으로 의식이란게 생기기 시작했을때
en: when the first glimmers of consciousness began to arise in him...

source: 무슨!!
en: what...?

source: 온몸으로 빈틈을 표현하는게냐?
en: have you decided to stop defending yourself?

source: 사탄:666
en: satan:666

source: 예쓰!
en: yes!

source: ...법사...
en: mage...

source: 한곳에 모였다면...
en: if they're all gathered in one place...

source: 최고 출력 대비 64%밖에 낼 수 없지만, 지금은 이게 최선
en: you’ll only be able to use 64% of your max output, but this is the best I can do right now.

source: 그래서 나의 어떤 욕망을 극단적으로 부추겼길래 신이 된거지?
en: so which of my desires did it affect to make me want to become a god?

source: 이건..!
en: this is...

source: 박무봉의 모습은...
en: mubong park was...

source: 미래시로 봤거든.
en: i had a vision.

source: 각 차원의 제천대성 답게 강하군
en: as expected, each dimension’s jaecheondaeseong is strong.

source: 일점돌파?!
en: the single-point break?!

source: 전율 戰慄
en: chills down his spine.

source: 마치 이 별의 모든 기운이 진모리의 발끝으로 모여드는것만 같다.
en: ...all of this planet’s energy is gathering into mori’s foot.

source: 센스는 있다만, 너무 게을러.
en: you have talent, but you’re too lazy.

source: 1천계 주인 사탄
en: master of the first heavenly realm satan

source: 참고로 여래의 육편은 인간들의 신체에 특별한 영향을 주진 않지만...
en: just so you know, tathagata’s flesh doesn’t affect humans physically...

source: 각오는 됐음.
en: i’m ready for whatever happens.

source: 이것 때문에...{j}우리쪽 세상은 끝장나버렸지...
en: my world was wiped out because of it...{j}

source: 사람들은 우리가 어떻게든 해볼테니까, 마음껏 날뛰어.
en: we'll do something about these people, so go all out.

source: 자신을 지키던 존재가 순식간에 고깃덩이로 변하는 모습을 목격한다.
en: ...he witnessed the beings who had been his protectors turn instantly into meat.

source: 그러니까...
en: so...

source: 힘과 스피드가 높아진건 사실이지만, 단지 그것 뿐.
en: it’s true your strength and speed have increased, but that’s all.

source: 모!!
en: mo!!!

source: 고속증식 & 진화
en: high-speed multiplication, plus evolution

source: 사물을 분간한다.
en: based on their power level.

source: 피{j}잇
en: {j}whish

source: 까득
en: grit

source: NOA 선체는 이미 한계!
en: NOA’s hull is at its limit!

source: ...!{j}넌 진짜!
en: {j}you really...

source: 항상 두려웠다.
en: i was always terrified.

source: 더 쎄게.
en: more power.

source: 하지만...
en: but...

source: 아자!
en: you’ve got this!

source: 츳 츠츠
en: swoosh

source: 봤다는 최선의 결과?
en: was this really our best option?

source: 전 집행위원, 힘은 얼마 안남았겠지만, 민간인 보호에 최우선 하도록.
en: former executives, i know you don't have much strength left, but prioritize protecting civilians.

source: 진정한 신인합일을 이룰지니...!
en: and achieve a true union between mankind and the gods...!

source: 조금만 더 버텨...!
en: hold out for just a little longer...!

source: NOA 엔진룸
en: noa engine room

source: 일단 한번 해보지.
en: I say we try it out.

source: 불룩
en: pop

source: 내 살점...
en: it is my flesh...

source: 박사님...{j}잠시만...
en: excuse me, professor...{j}

source: 힘...{j}주러 왔어.
en: {j}i came to give you energy...

source: 아이가 보고 배웠던 여러 감정들 슬픔, 연민, 그리고...
en: the many emotions she had seen and learned since then... sadness, sympathy, and...

source: 제우스?
en: zeus?

source: 뭐해?
en: what are you doing?

source: 다른차원의 제천대성
en: jaecheondaeseongs from another dimension.

source: 넌
en: you...

source: 잘 했을까?
en: do a good job?

source: 네가 동정받으려면 십백만팔천사백번쯤 다시 태어나야 해
en: you’ll have to be reborn 110,008,400 times before getting any sympathy.

source: 나 사탄이 될 거야.
en: ...the master of the first heavenly realm.

source: 억{j}처
en: tup{j}

source: 결국 힘의 크기 대결로 승부본다면 내쪽이 더 강하다.
en: if it comes down to a contest of strength, i have the upper hand.

source: 어차피 한번 뒈진거!{j}뭐가 무서워?!
en: I’ve already died once! what’s there to be afraid of?!

source: 롹앤롤!
en: rock-and-roll!

source: 대천사 루시페르
en: archangel lucifer

source: 휘모리
en: ...mori hui.

source: 신과 한판
en: a battle with the gods

source: 그래..
en: i see...

source: 아그야.
en: fellas.

source: 죽어
en: die.

source: 우린 어쩌면...
en: we could be witnessing a moment...

source: 1{j}천계 주인이자
en: the master of the first heavenly realm...{j}

source: 그거 바르면 치유가 될거야.
en: rub that on you. it’ll fix you right up.

source: 태양에서 잉태된
en: the one that was conceived on the sun.

source: 이건?
en: this is...?

source: 2층 꼭대기에 도달했을 즈음
en: ...and around the time that he reached the top of the second floor...

source: 훙
en: whish

source: 모두가 널 기다려...
en: everyone’s waiting for me...

source: 아이의 눈에 각인된 첫 기억... ‘버려짐...외로움...{j}안타까움...’
en: the child’s first memory, now etched into her mind... abandonment... loneliness... frustration...{j}

source: 그러기 위한 죽음이다
en: that is why i die.

source: 강요저
en: gangyojeo

source: 그딴 수준의 육체로 저 녀석을 잡겠다고?
en: you’re gonna beat him in your current state?

source: STIGMA 사탄도, 1천계 신도, 한대위도 모두 원샷 원킬로 당했던 최강의 기술
en: stigma. the ultimate technique that one-hit ko’d satan, the gods of the first heavenly realm, and daewi han.

source: 이쪽에선 박무진이 여래군...
en: so here, mujin park is tathagata...

source: 제아봉침
en: jeabongchim

source: 조금만..{j}버텨!!
en: hold out... a little longer!!!{j}

source: 칫{j}흠
en: flinch{j}

source: 뚫어버려.
en: break through it.

source: 신일까?
en: or a god?

source: 근두운 시전은 더이상 무리!
en: activating geundoowun any more is impossible!

source: 쉽사리 컨트롤 되지 않는 무기는 실패작
en: a weapon you can’t easily control is a failure.

source: 벌어지고 있는거...지?
en: going on?

source: 하지만 강해.
en: but he's strong.

source: 궁
en: boom

source: 요정 군체 각 위치 좌표 확인 및 공유
en: confirming each fairy colony's location and sending them your way.

source: 쎄게...
en: power...

source: 그저 아무 것도 못하고 죽고 싶지는 않을뿐
en: i just didn’t want to die without accomplishing anything.

source: 여래?!
en: tathagata?!

source: 부디 오딘을...
en: please... odin...

source: 크하!
en: haha!

source: 끼이익
en: creaaak

source: 아프지마.
en: feel better.

source: 어떤 미친놈이 저런 생각을 해?!
en: who thinks like that?!

source: 그리고 그 적의가 자신을 향할 때.
en: by the time that hostility was directed at him...

source: 즉 네 스스로 신이 된게 아니라, 여래의 육편이 네가 신이 되고프게끔 이끌었던 거야.
en: in other words, you didn’t become a god because you wanted to. it was because of tathagata’s flesh.

source: 웅{j}구
en: boom{j}

source: 왜 나를 거부하는거지 인간?
en: why do you reject me, human?

source: 미친새X
en: that’s absurd.

source: 죽어라 원숭아!
en: die, monkey!

source: 부탁해!
en: we’re counting on you,

source: 최대한 선수쪽으로 대피하라!
en: evacuate as close to the bow of the ship as possible!

source: 무조건 박살내버려!
en: crush him, no matter what!

source: 박무봉...{j}네가...
en: mubong...{j}

source: 혹시나 그 예언이 가이아의 한낱 농짓거리었다면...
en: should it be revealed that the prophecy was gaia’s idea of a joke...

source: 한명 한명이 버겨울거야.
en: every single one of them will be a tough opponent.

source: 엄청난 일이 벌어지고 있어...
en: something incredible is happening...

source: 앗뜨뜨
en: ouch, that’s hot!

source: 두 눈 크게 뜨고 지켜봐줘.
en: watch me closely.

source: 언제부터 그렇게 말이 많았지?
en: ...but since when were you such a talker?

source: 서둘러!
en: hurry!

source: 아
en: ah!

source: 짐이 되지 않을거야!
en: we won’t be a burden!

source: 오오..{j}이쪽 세계에도 존재하는군...{j}여래의 실패작.
en: ohhh, it exists in this world, too... tathagata's failed weapon, i mean.{j}{j}

source: 어떡해!
en: what do we do?!

source: 훗날 전설을 넘어 신화로 불릴 순간을 목격하고 있는걸지도...
en: ...that’ll be remembered as more myth than legend.

source: 여의가 얼마나 버텨줄 수 있을지 궁금하구나.
en: i’m curious how much more the yeoui can take.

source: 움{j}찔
en: flinch{j}

source: 558화
en: episode 558

source: 단아한...?
en: ahan...?

source: 무조건 이겨!
en: win, no matter what!

source: 그래...이곳에도 새로운 선지자가 태어났구나.
en: yes... a new prophet has been born here as well.

source: 554화
en: episode 554

source: 이거 가지각색이군.
en: it seems we have quite the mixed bag here.

source: 아줌마!!
en: ms. heal!!!

source: 열렸....다...
en: it stopped...

source: 욱{j}슈
en: whoosh{j}

source: 이젠 뭐가 남았지?
en: what’s left?

source: 도망쳐!!
en: run!!!

source: 그 2개는 유일하게 여래가 직접 만든 무기이자 실패작.
en: those two were the only ones he had created himself. they were failures.

source: 히~
en: hehe.

source: 여래랑 닮았어.
en: ...and tathagata are alike.

source: 후둑
en: splash

source: 그런 구멍 하나는 만들 수 있을거임
en: i have it in me to make you one.

source: 저녀석과의 싸움에서...{j}졌거든.
en: i lost to that guy in a fight.{j}

source: 쫘{j}악
en: slash{j}

source: 구역 폐쇄!
en: seal off the area!

source: 각오만으론 안돼.
en: resolve is not enough.

source: 그 괴물들을 이끌 수장은 과연 누가 될까?
en: who will be the one to lead those monsters?

source: 역대 최약체 상태에서...{j}최고위 레벨업으로 점프업 했다면?
en: what if he’s leveled up from his weakest ever to the highest point anyone can possibly reach...?{j}

source: 다 먹혀버리기 전에...
en: before I am devoured...

source: 왜저래?
en: what’s up with him?

source: 토착신에게 들은 마이트레야, 선지자 그리고 절대신...
en: maitreya, the prophet and the supreme god foretold by the native god...

source: 설마...?
en: could it be...?

source: 劍
en: the way of the sword.

source: 파팡
en: pow pow

source: 모두들 내뒤로!
en: everyone, get behind me!

source: 몇몇의 리더에 의해 움직임이 군단위로 통제 된다.
en: ...but they're actually divided into units under the control of a few leaders.

source: 그런거 싫어.
en: i don’t want that.

source: 모두의 힘이...
en: ...everyone’s power...

source: 우리 세상에선 저녀석 동네 셔틀 취급인데...
en: in my world, he's that one guy everyone picks on...

source: 齊天大聖
en: jaecheondaeseongs from another dimension.

source: 범위가...{j}너무 넓어.
en: their attack range is too big...{j}

source: 힘을...줄게
en: i’ll give you energy...

source: 모.
en: mo.

source: 다른차원에서 굶어죽도록.
en: go starve to death in another dimension.

source: 생각보다 약하구나.
en: you’re weaker than i thought.

source: 너희가 가는게...
en: for the two of you to go instead of me...?

source: 미안하구나...
en: i’m sorry...

source: 힘 대부분을 아우에게 줘서...{j}힘이 후달려!
en: I gave most of my power to bro... so I’m not strong enough!

source: 콰당!
en: crash

source: 방주 47%대파
en: 47% of arks have major damage

source: 넌 싹이 보여.
en: you have promise.

source: 으아아아!!
en: ahhh!!!

source: 넌 평생 내 최고의 술자리 안줏거리야.
en: i’m gonna milk this story for the rest of my life.

source: 파창
en: shatter

source: 내게로 오라!
en: come to me!

source: 나 대신...
en: wouldn’t it be better...

source: 그 후로...
en: and...

source: 팍
en: whoosh

source: 星雲雷電
en: NEBULA THUNDERBOLT

source: 오빠?
en: mori?

source: 넌 평생 내 술자리 안줏거리야.
en: i’m gonna milk this story for the rest of my life.

source: 족쳐버려.
en: turn him into dust.

source: 석{j}퍼
en: snap{j}

source: 응...
en: yeah...

source: 으아!
en: ah!

source: 시간이여!
en: hear me, time!

source: 목표한 바는 이루고 원래의 차원으로 돌아가겠군!
en: once we're done here, I've gotta get back to my original dimension!

source: 열두 쌍의 날개
en: twelve double wings

source: 필요할 땐 아무런 도움도 안되는데!
en: if you can’t help someone when you’re needed!

source: 기다려 오빠...
en: wait for me, mori...

source: 이...{j}벌레들...
en: you... insects...

source: 전세대 여의
en: yeouis of the previous generation...

source: 모두들 주의하는게 좋아.
en: you should all stay on your toes.

source: 자...{j}이제 진정 날 받아들여야 할 때가 왔구나 인간...
en: now...{j}it is time for you to truly accept me, human...

source: 진모리..?
en: mori?

source: 상처가 깊어!
en: her wound is deep!

source: 졌거든.
en: in a fight.

source: 너같은 녀석을 잡는게 내...{j}마지막 사명.
en: my final mission... is to take down someone like you.{j}

source: 스치기만해도 위험해!
en: it’s dangerous even if it just grazes you!

source: 어디론가 사라질까봐...
en: ...that he’d go off somewhere without me...

source: Archuangel
en: Archangel
